"""
8.  Написать программу решения задачи: найти длины медиан треугольника, заданного координатами своих вершин A, B, C.
"""
import math

x1, y1 = map(int, input('Введите две координаты точки А через пробел: ').split())
x2, y2 = map(int, input('Введите две координаты точки B через пробел: ').split())
x3, y3 = map(int, input('Введите две координаты точки C через пробел: ').split())


#  уравнения медиан AA1,BB1,CC1
#  поиск координат А1, В1, С1

xA1 = (x2+x3)/2
yA1 = (y2+y3)/2

xB1 = (x1+x3)/2
yB1 = (y1+y3)/2

xC1 = (x1+x2)/2
yC1 = (y1+y2)/2


#  длины медиан |AA1|,|BB1|,|CC1| из вершин A,B и C

AA1 = math.sqrt((xA1 - x1)**2 + (yA1 - y1)**2)
BB1 = math.sqrt((xB1 - x2)**2 + (yB1 - y2)**2)
CC1 = math.sqrt((xC1 - x3)**2 + (yC1 - y3)**2)


print('Длина медианы AA1 =', AA1,
      '\nДлина медианы BB1 =', BB1,
      '\nДлина медианы CC1 =', CC1)
