"""
9.Написать программу решения задачи: найти длины биссектрис треугольника, заданного координатами своих вершин A, B, C.
"""

import math

x1, y1 = map(int, input('Введите две координаты точки А через пробел: ').split())
x2, y2 = map(int, input('Введите две координаты точки B через пробел: ').split())
x3, y3 = map(int, input('Введите две координаты точки C через пробел: ').split())


a = math.sqrt((x2 - x1)**2 + (y2 - y1)**2)
b = math.sqrt((x3 - x2)**2 + (y3 - y2)**2)
c = math.sqrt((x3 - x1)**2 + (y3 - y1)**2)

L1 = (math.sqrt(a*b*(a+b+c)*(a+b-c)))/(a+b)
L2 = (math.sqrt(b*c*(b+c+a)*(b+c-a)))/(b+c)
L3 = (math.sqrt(a*c*(a+c+b)*(a+c-b)))/(a+c)

print('Длина биссектрисы L1 =', L1,
      '\nДлина биссектрисы L2 =', L2,
      '\nДлина биссектрисы L3 =', L3)


