"""
7.	Разработать алгоритм и реализовать программу решения системы линейных уравнений:
	  a11x + a12y = b1 ,  a21x + a22y = b2.
"""

a11, a12, b1 = map(float, input("Введите коэффициенты уравнения a11x + a12y = b1: ").split())
a21, a22, b2 = map(float, input("Введите коэффициенты уравнения a21x + a22y = b2: ").split())

try:
    x = (b1*a22 - a12*b2) / (a11*a22 - a12*a21)
    y = (a11*b2 - b1*a21) / (a11*a22 - a12*a21)
    print("x =", x, "y =", y)
except Exception:
    print("Error")